In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns

In [2]:
df = pd.read_csv('train.csv')

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
df.groupby('Pclass')['Fare'].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [10]:
df.groupby('Sex')['Survived'].mean()*100

Sex
female    74.203822
male      18.890815
Name: Survived, dtype: float64

In [17]:
df.groupby(['Pclass','Sex'])['Survived'].agg({'mean','count'})

                   mean  count
Pclass Sex
1      female  0.968085     94
       male    0.368852    122
2      female  0.921053     76
       male    0.157407    108
3      female  0.500000    144
       male    0.135447    347

In [24]:
titanic_df= df
titanic_df['LastName'] = titanic_df['Name'].str.split(',').str[0]

In [25]:
titanic_df[['Name','LastName']]

                                                  Name   LastName
0                              Braund, Mr. Owen Harris     Braund
1    Cumings, Mrs. John Bradley (Florence Briggs Th...    Cumings
2                               Heikkinen, Miss. Laina  Heikkinen
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   Futrelle
4                             Allen, Mr. William Henry      Allen
..                                                 ...        ...
886                              Montvila, Rev. Juozas   Montvila
887                       Graham, Miss. Margaret Edith     Graham
888           Johnston, Miss. Catherine Helen "Carrie"   Johnston
889                              Behr, Mr. Karl Howell       Behr
890                                Dooley, Mr. Patrick     Dooley

[891 rows x 2 columns]

In [39]:
cond = titanic_df['Name'].str.contains('Miss.')

In [46]:
result = titanic_df[cond]
result[['Name']]
len(result)

182

In [ ]:
titanic_df['Name'].str.replace(')' , '').str.replace('(' , '')

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley Florence Briggs Thayer
2                                 Heikkinen, Miss. Laina
3             Futrelle, Mrs. Jacques Heath Lily May Peel
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [57]:
date_strings = pd.Series(['2025-01-01', '2025-03-15', '2025-03-31',])
print('문자열 형태 :\n', date_strings)

문자열 형태 :
 0    2025-01-01
1    2025-03-15
2    2025-03-31
dtype: object

In [58]:
date_strings = pd.to_datetime(date_strings)
date_strings

0   2025-01-01
1   2025-03-15
2   2025-03-31
dtype: datetime64[ns]

In [61]:
date_strings.dt.year

0    2025
1    2025
2    2025
dtype: int32

In [60]:
date_strings.dt.month

0    1
1    3
2    3
dtype: int32

In [62]:
date_strings.dt.day

0     1
1    15
2    31
dtype: int32

In [63]:
date_strings.dt.date

0    2025-01-01
1    2025-03-15
2    2025-03-31
dtype: object

In [70]:
# Embarked 값에 따른 탑승 일시 매핑
embark_to_time = {'S': '1912-04-10 12:00:00',
         'C': '1912-04-10 18:00:00',
         'Q': '1912-04-11 12:00:00'}
# BoardTime 열 추가 (현재는 문자열 상태)
titanic_df['BoardTime'] = titanic_df['Embarked'].map(embark_to_time)
print(titanic_df[['Embarked', 'BoardTime']].head(3))

  Embarked            BoardTime
0        S  1912-04-10 12:00:00
1        C  1912-04-10 18:00:00
2        S  1912-04-10 12:00:00

In [77]:
titanic_df['BoardTime']= pd.to_datetime(titanic_df['BoardTime'])

In [75]:
titanic_df['BoardTime'].min()

Timestamp('1912-04-10 12:00:00')

In [76]:
titanic_df['BoardTime'].max()

Timestamp('1912-04-11 12:00:00')

In [79]:
titanic_df['BoardTime'].dt.date.value_counts()

BoardTime
1912-04-10    812
1912-04-11     77
Name: count, dtype: int64

In [80]:
classA = pd.DataFrame({'ID': [1, 2, 3],
            'Score': [50, 60, 70]})
classB = pd.DataFrame({'ID': [4, 5],
            'Score': [80, 90]})
combined = pd.concat([classA, classB], axis=0, ignore_index=True)
print("행 방향 결합 결과:\n", combined)

행 방향 결합 결과:
    ID  Score
0   1     50
1   2     60
2   3     70
3   4     80
4   5     90

In [81]:
names = pd.Series(['Alice', 'Bob', 'Charlie'])
scores = pd.Series([85, 92, 88])
merged_df = pd.concat([names, scores], axis=1)
merged_df.columns = ['Name', 'Score']
print("열 방향 결합 결과:\n", merged_df)

열 방향 결합 결과:
       Name  Score
0    Alice     85
1      Bob     92
2  Charlie     88